{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "24"}]}}}, "outputs": {"tokenizer": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_3/activation_2/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_3/activation_3/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "24"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/flatten_1/Reshape", "op": "Reshape", "input": ["args_0", "StatefulPartitionedCall/model_3/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_3/flatten_1/Reshape", "StatefulPartitionedCall/model_3/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_3/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/activation_2/Gelu/mul/x", "StatefulPartitionedCall/model_3/dense_3/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/dense_3/BiasAdd", "ConstantFolding/StatefulPartitionedCall/model_3/activation_2/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/model_3/activation_2/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/activation_2/Gelu/add/x", "StatefulPartitionedCall/model_3/activation_2/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/activation_2/Gelu/mul", "StatefulPartitionedCall/model_3/activation_2/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_3/activation_2/Gelu/mul_1", "StatefulPartitionedCall/model_3/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_3/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/activation_3/Gelu/mul/x", "StatefulPartitionedCall/model_3/dense_4/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/dense_4/BiasAdd", "ConstantFolding/StatefulPartitionedCall/model_3/activation_3/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/model_3/activation_3/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/activation_3/Gelu/add/x", "StatefulPartitionedCall/model_3/activation_3/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/activation_3/Gelu/mul", "StatefulPartitionedCall/model_3/activation_3/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_3/activation_3/Gelu/mul_1", "StatefulPartitionedCall/model_3/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_3/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tokenizer/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model_3/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_3/tokenizer/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/activation_3/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/activation_2/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_3/dense_3/MatMul/ReadVariableOp", "shape": [384, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/dense_3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_3/activation_2/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/dense_4/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/dense_4/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_3/activation_3/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/dense_5/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_3/dense_5/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}]}]}